In [68]:
import pandas as pd
import csv
import math
from datetime import datetime

In [12]:
# NUS number of students


years = pd.date_range(start="2018", end="2023", freq='Y')
ns = [30098, 31257, 31760, 31272, 32335]

nus = pd.DataFrame(data={'Year': years, 'Number of Students': ns})
nus.set_index('Year', inplace=True)

print(nus)

            Number of Students
Year
2018-12-31               30098
2019-12-31               31257
2020-12-31               31760
2021-12-31               31272
2022-12-31               32335

In [14]:
# NUS number of students


years = pd.date_range(start="2018", end="2023", freq='Y')
ps = [8449, 8483, 7870, 8496, 8895]

princeton = pd.DataFrame(data={'Year': years, 'Number of Students': ps})
princeton.set_index('Year', inplace=True)

print(princeton)

            Number of Students
Year
2018-12-31                8449
2019-12-31                8483
2020-12-31                7870
2021-12-31                8496
2022-12-31                8895

In [19]:
stu_ct = pd.DataFrame(data={'Year': years, 'Princeton': ps, 'NUS': ns})
stu_ct.set_index('Year',inplace=True)
stu_ct
stu_ct['times'] = stu_ct['NUS']/stu_ct['Princeton']
stu_ct

            Princeton    NUS     times
Year
2018-12-31       8449  30098  3.562315
2019-12-31       8483  31257  3.684663
2020-12-31       7870  31760  4.035578
2021-12-31       8496  31272  3.680791
2022-12-31       8895  32335  3.635188

In [8]:
# SF Population 
data = {'Date': ["2018-01-01", "2019-01-01", "2020-01-01", "2021-01-01", "2022-01-01"],
        'Value': [879.676, 878.826, 870.393, 811.253, 808.437]}

# Create the DataFrame
sf = pd.DataFrame(data)

# Convert the 'Date' column to datetime
sf['Date'] = pd.to_datetime(sf['Date'])

# Set 'Date' as the index
sf.set_index('Date', inplace=True)

print(sf)

              Value
Date
2018-01-01  879.676
2019-01-01  878.826
2020-01-01  870.393
2021-01-01  811.253
2022-01-01  808.437

In [ ]:
nus_residents = 11000

In [3]:
# Add residence boolean value

bldgs = pd.read_csv('list_bldgs.csv')

          Buildings Location  Longtitude    Latitude
0    10 KR BUNGALOW       KR    1.294411  103.778502
1    11 KR BUNGALOW       KR    1.293319  103.773661
2   12A KR BUNGALOW       KR    1.297235  103.774759
3    12 KR BUNGALOW       KR    1.297234  103.773910
4  14A PGP BUNGALOW      PGP    1.293265  103.777459

In [8]:
bldgs['Residence'] = bldgs['Buildings'].str.contains('APARTMENT|RESIDENCE|BUNGALOW|COLLEGE|HALL', case=False, na=False)
bldgs.to_csv('list_bldgs.csv')

In [41]:
# eda princeton
pdf =pd.read_csv('princeton.csv')
pdf.shape

(492, 8)

In [42]:
pdf["Date"]

0      10/28/2022
1      10/28/2022
2      10/28/2022
3      10/28/2022
4      10/29/2022
          ...
487    10/14/2023
488    10/23/2023
489    10/24/2023
490    10/25/2023
491    10/26/2023
Name: Date, Length: 492, dtype: object

In [51]:
pdf['Date'] = pd.to_datetime(pdf['Date'])
#data from oct 28 2022 to oct 26 2023
#as academic year 2022/23

In [60]:
# number of rows needed
#492/popn2023*popn*times
pcount = round(492/8895 * stu_ct["Princeton"])
nuscount = round(492/8895 * stu_ct["Princeton"] * stu_ct['times'])

case_ct = pd.DataFrame(data={'Year': years, 'Princeton count': pcount, 'NUS count': nuscount})
case_ct

                 Year  Princeton count  NUS count
Year
2018-12-31 2018-12-31            467.0     1665.0
2019-12-31 2019-12-31            469.0     1729.0
2020-12-31 2020-12-31            435.0     1757.0
2021-12-31 2021-12-31            470.0     1730.0
2022-12-31 2022-12-31            492.0     1789.0

In [62]:
case_ct["NUS count"]

Year
2018-12-31    1665.0
2019-12-31    1729.0
2020-12-31    1757.0
2021-12-31    1730.0
2022-12-31    1789.0
Name: NUS count, dtype: float64

In [ ]:
count = [1665, 1729, 1757, 1730, 1789]